<template>
<div class="main_notice">
    <el-collapse v-model="activeNames">
        <el-collapse-item v-for="item of noticeList" :key="item.id" :name="item.id">
            <template slot="title">
                <div class="title">{{item.title}}</div>
                <div class="date">{{item.date}}</div>
            </template>
            <div>{{item.con}}</div>
        </el-collapse-item>
    </el-collapse>
</div>

</template>

<script type='text/ecmascript-6'>
    export default {
        name:"SystemNotice",
        data () {
            return {
                activeNames:[this.$route.query.id],
                noticeList:[
                    {
                        id:"001",
                        date:"2018-03-02",
                        title:"首旅如家供应商系统新版上线！",
                        con:"如家酒店集团私有化交易完成，正式回归赴新征程如家酒店集团（以下简称“如家”）于2015年12月6日和A股上市公司北京首旅酒店（集团）股份有限公司（以下简称“首旅酒店”）及其关联公司共同签署了合并协议，由首旅酒店以合并方式向如家酒店集团非主要股东支付现金对价，实现如家的私有化。2016年3月25日，如家酒店集团股东大会审议并通过了其与首旅酒店的合并协议及私有化交易。此次私有化交易于4月1日完成了交割，同时如家从美国纳斯达克完成退市，并成为首旅酒店控股子公司，回归国内市场。首旅酒店作为最大股东，持有如家约65%股权。如家酒店集团管理团队阵容不变。 自成立以来，截止2015年12月31日，如家酒店集团在中国市场355个城市共有2922家酒店正式运营。此次合并，提供给了首旅酒店集团和如家酒店集团更加紧密合作的机遇，预示着双方将共同拥有更好的资源、更多的人才和更广的平台。相信在可预见的将来，双方将共同努力打造一个集酒店、旅游及文化于一体的成功服务型企业。为广大消费者提供更多、更好、更精致的旅游服务产品，为中国旅游业与酒店业的发展做出更多贡献。"
                    },
                    {
                        id:"002",
                        date:"2018-03-02",
                        title:"首旅如家供应商系统新版上线！",
                        con:"如家酒店集团私有化交易完成，正式回归赴新征程如家酒店集团（以下简称“如家”）于2015年12月6日和A股上市公司北京首旅酒店（集团）股份有限公司（以下简称“首旅酒店”）及其关联公司共同签署了合并协议，由首旅酒店以合并方式向如家酒店集团非主要股东支付现金对价，实现如家的私有化。2016年3月25日，如家酒店集团股东大会审议并通过了其与首旅酒店的合并协议及私有化交易。此次私有化交易于4月1日完成了交割，同时如家从美国纳斯达克完成退市，并成为首旅酒店控股子公司，回归国内市场。首旅酒店作为最大股东，持有如家约65%股权。如家酒店集团管理团队阵容不变。 自成立以来，截止2015年12月31日，如家酒店集团在中国市场355个城市共有2922家酒店正式运营。此次合并，提供给了首旅酒店集团和如家酒店集团更加紧密合作的机遇，预示着双方将共同拥有更好的资源、更多的人才和更广的平台。相信在可预见的将来，双方将共同努力打造一个集酒店、旅游及文化于一体的成功服务型企业。为广大消费者提供更多、更好、更精致的旅游服务产品，为中国旅游业与酒店业的发展做出更多贡献。"
                    },
                    {
                        id:"003",
                        date:"2018-03-02",
                        title:"首旅如家供应商系统新版上线！",
                        con:"如家酒店集团私有化交易完成，正式回归赴新征程如家酒店集团（以下简称“如家”）于2015年12月6日和A股上市公司北京首旅酒店（集团）股份有限公司（以下简称“首旅酒店”）及其关联公司共同签署了合并协议，由首旅酒店以合并方式向如家酒店集团非主要股东支付现金对价，实现如家的私有化。2016年3月25日，如家酒店集团股东大会审议并通过了其与首旅酒店的合并协议及私有化交易。此次私有化交易于4月1日完成了交割，同时如家从美国纳斯达克完成退市，并成为首旅酒店控股子公司，回归国内市场。首旅酒店作为最大股东，持有如家约65%股权。如家酒店集团管理团队阵容不变。 自成立以来，截止2015年12月31日，如家酒店集团在中国市场355个城市共有2922家酒店正式运营。此次合并，提供给了首旅酒店集团和如家酒店集团更加紧密合作的机遇，预示着双方将共同拥有更好的资源、更多的人才和更广的平台。相信在可预见的将来，双方将共同努力打造一个集酒店、旅游及文化于一体的成功服务型企业。为广大消费者提供更多、更好、更精致的旅游服务产品，为中国旅游业与酒店业的发展做出更多贡献。"
                    },
                    {
                        id:"004",
                        date:"2018-03-02",
                        title:"首旅如家供应商系统新版上线！",
                        con:"如家酒店集团私有化交易完成，正式回归赴新征程如家酒店集团（以下简称“如家”）于2015年12月6日和A股上市公司北京首旅酒店（集团）股份有限公司（以下简称“首旅酒店”）及其关联公司共同签署了合并协议，由首旅酒店以合并方式向如家酒店集团非主要股东支付现金对价，实现如家的私有化。2016年3月25日，如家酒店集团股东大会审议并通过了其与首旅酒店的合并协议及私有化交易。此次私有化交易于4月1日完成了交割，同时如家从美国纳斯达克完成退市，并成为首旅酒店控股子公司，回归国内市场。首旅酒店作为最大股东，持有如家约65%股权。如家酒店集团管理团队阵容不变。 自成立以来，截止2015年12月31日，如家酒店集团在中国市场355个城市共有2922家酒店正式运营。此次合并，提供给了首旅酒店集团和如家酒店集团更加紧密合作的机遇，预示着双方将共同拥有更好的资源、更多的人才和更广的平台。相信在可预见的将来，双方将共同努力打造一个集酒店、旅游及文化于一体的成功服务型企业。为广大消费者提供更多、更好、更精致的旅游服务产品，为中国旅游业与酒店业的发展做出更多贡献。"
                    },
                    {
                        id:4,
                        date:"2018-03-02",
                        title:"首旅如家供应商系统新版上线！",
                        con:"如家酒店集团私有化交易完成，正式回归赴新征程如家酒店集团（以下简称“如家”）于2015年12月6日和A股上市公司北京首旅酒店（集团）股份有限公司（以下简称“首旅酒店”）及其关联公司共同签署了合并协议，由首旅酒店以合并方式向如家酒店集团非主要股东支付现金对价，实现如家的私有化。2016年3月25日，如家酒店集团股东大会审议并通过了其与首旅酒店的合并协议及私有化交易。此次私有化交易于4月1日完成了交割，同时如家从美国纳斯达克完成退市，并成为首旅酒店控股子公司，回归国内市场。首旅酒店作为最大股东，持有如家约65%股权。如家酒店集团管理团队阵容不变。 自成立以来，截止2015年12月31日，如家酒店集团在中国市场355个城市共有2922家酒店正式运营。此次合并，提供给了首旅酒店集团和如家酒店集团更加紧密合作的机遇，预示着双方将共同拥有更好的资源、更多的人才和更广的平台。相信在可预见的将来，双方将共同努力打造一个集酒店、旅游及文化于一体的成功服务型企业。为广大消费者提供更多、更好、更精致的旅游服务产品，为中国旅游业与酒店业的发展做出更多贡献。"
                    },
                    {
                        id:5,
                        date:"2018-03-02",
                        title:"首旅如家供应商系统新版上线！",
                        con:"如家酒店集团私有化交易完成，正式回归赴新征程如家酒店集团（以下简称“如家”）于2015年12月6日和A股上市公司北京首旅酒店（集团）股份有限公司（以下简称“首旅酒店”）及其关联公司共同签署了合并协议，由首旅酒店以合并方式向如家酒店集团非主要股东支付现金对价，实现如家的私有化。2016年3月25日，如家酒店集团股东大会审议并通过了其与首旅酒店的合并协议及私有化交易。此次私有化交易于4月1日完成了交割，同时如家从美国纳斯达克完成退市，并成为首旅酒店控股子公司，回归国内市场。首旅酒店作为最大股东，持有如家约65%股权。如家酒店集团管理团队阵容不变。 自成立以来，截止2015年12月31日，如家酒店集团在中国市场355个城市共有2922家酒店正式运营。此次合并，提供给了首旅酒店集团和如家酒店集团更加紧密合作的机遇，预示着双方将共同拥有更好的资源、更多的人才和更广的平台。相信在可预见的将来，双方将共同努力打造一个集酒店、旅游及文化于一体的成功服务型企业。为广大消费者提供更多、更好、更精致的旅游服务产品，为中国旅游业与酒店业的发展做出更多贡献。"
                    }
                 ]
            };
        }
    }

</script>
<style lang='less'>
.main_notice{
    margin:35px auto 40px;
    padding:0 25px;
    width:1148px;
    border:1px solid #EBEBEB;
    .el-collapse{
        border:0 none;
    }
    .el-collapse-item{
        border-bottom:1px solid #ebebeb;
        &:last-child{
            margin-bottom:0;
            border-bottom:0 none;
        }
        .el-collapse-item__header{
            height:50px;
            border-bottom:0 none;
            line-height: 50px;
            cursor: pointer;
            font-weight: normal;
            overflow: hidden;     
            .date{
                float:right;
                padding-right:25px;
                font-size:14px;
                color:#979797;
            }
            .title{
                float:left;
                font-size:16px;
                color:#2F2E2E;
            }
            .el-collapse-item__arrow{
                margin:24px 0 0 0;
                width:9px;
                height:5px;
                background: url("../../assets/images/nav_down.png") no-repeat center center;
                font-size:0;
                &.is-active{
                    transform: rotate(-180deg);
                }
            }
        }
        .el-collapse-item__wrap{
            border-bottom:0 none;
        }
        .el-collapse-item__content{
            padding-bottom:20px;
            color:#535353;
            font-size:14px;
            line-height: 26px;
            overflow: hidden;
        }
    }
}

</style>